apache_benchmark/results/nginx_to_gunicorn_nocache.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.29.4
Server Hostname:        0.0.0.0
Server Port:            8080

Document Path:          /dynamic-nocache/
Document Length:        165 bytes

Concurrency Level:      10
Time taken for tests:   0.303 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      308000 bytes
HTML transferred:       165000 bytes
Requests per second:    3297.98 [#/sec] (mean)
Time per request:       3.032 [ms] (mean)
Time per request:       0.303 [ms] (mean, across all concurrent requests)
Transfer rate:          991.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     1    3   1.0      3       9
Waiting:        1    3   1.0      3       9
Total:          1    3   1.0      3       9

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      4
  80%      4
  90%      4
  95%      5
  98%      5
  99%      7
 100%      9 (longest request)